app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product = Product.find(params[:id])

INSERT INTO "products" ("name", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "edf"], ["price", 45.0], ["description", "4rtfd"], ["created_at", "2022-03-08 11:13:38.808639"], ["updated_at", "2022-03-08 11:13:38.808639"]]
---
  def create
    @product = Product.create(params.require(:product).permit(:name, :price, :description))

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Paper"], ["updated_at", "2022-03-08 11:23:28.628463"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(params.require(:product).permit(:name, :price, :brand))

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 9]]
---
  def destroy
    @product = Product.find(params[:id])
    if @product.delete